________________________________________Show

()show ip interface brief
()show interface trunk
()show controllers FastEthernet 1/1        >>Mostrar Controladores de las interfaces

()#show interfaces
Es un comando muy util. En la busqueda de Errores en la red podemos identificarlo en los campos: Input/Output Errors:
Runt Frames: Tramas de menor tamaña a las permitidas (Fragmentos de colision)
Giants: Tramas de tamaño gigante que supera el maximo permitido.
CRC Errors: Errores en los medios o en los cables (Interferencias-Cables dañados-Ruido en enlace)
Collisions: Normales en Half-Duplex. No deberían suceder en modo Full-Duplex.
Late Collisions: Colisiones tardias. Generalmente se debe a long excesiva del cable o config Half(extremo1)-Full(extremo2)



________________________________________Vlan Interface

switchport access vlan "numero"       //se usa para crear una Vlan
show mac address-table                //nos ayuda a ver los puertos asignados a Vlans
switchport mode trunk                 //para habilitar los enlaces troncales
show interfaces trunk                 //verificar enlaces troncales establecidos

DTP: Protocolo de enlace troncal dinamico. Default ON. Punto a Punto. Negociacion de los enlaces troncales.

delete flash:vlan.dat & erase startup-config //Retorna el switch a su condicion de fabrica con una Vlan predeterminada.


Switch()#conf term
Switch(config)#interface vlan 99
Switch(config-if)#ip addr 192.9.200.99 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#end
Switch()#copy running-config startup-config
Switch()#conf term
Switch(config)#ip default-gateway 192.9.200.1
Switch(config)#end
Switch()copy running-config startup-config

Switch(config)#interface fa0/0
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk native vlan 99
Switch(config-if)end




________________________________________Config Ruta estatica en Router

Router> enable 
Router# configure terminal
Router(config)#ip route 192.168.2.0 255.255.255.0 fa0/0
Router(config)#ip route 192.168.1.0 255.255.255.0 fa0/1



_________________________________________ssh access to router configuration:

SSH(config)# ip ssh version 2
SSH(config)# ip domain-name [Nombre] (1)
SSH(config)# crypto key generate rsa(2)
SSH(config)# line vty 0 4
SSH(config-line)# transport input ssh(3)
SSH(config-line)# login local
SSH(config)# username [usuario] privilege 15 password [password] (4)
SSH(config)# enable secret [password] (5)


Nota: para eliminar el par de claves RSA, use el comando crypto key zeroize rsa del modo de configuración global. 
Después de eliminarse el par de claves RSA, el servidor SSH se deshabilita automáticamente.

_________________________________________Copiar running-config a un servidor TFTP:

router01#copy running-config tftp

_________________________________________Copia de Seguridad y Restauracion mediante USB:

a USB:
R1# copy run usbflash0:/

desde USB
R1# copy usbflash0:/R1-Config running-config

__________________________________________
