OSPFv2 Básico

Router>enable                                                     /Accedemos a Conf mode
Router#conf ter                                                   /Idem
Router(config)#router ospf 10                                     /Delaramos el uso de OSPF
Router(config-router)#router-id 1.1.1.1                           /Definimos el id de Router
//La sintaxis básica del comando es network dirección-red máscara-wildcard area id-área
Router(config-router)#network 172.16.1.0 0.0.0.255 area 0         /Declaramos las redes conectadas a las interfaces del Router
Router(config-router)#network 172.16.3.0 0.0.0.3 area 0           /Declaramos las redes conectadas a las interfaces del Router
Router(config-router)#network 192.168.10.4 0.0.0.3 area 0         /Declaramos las redes conectadas a las interfaces del Router
//Como alternativa, todas las interfaces se pueden convertir en pasivas con el comandopassive-interface default. 
//Las interfaces que no deben ser pasivas se pueden volver a habilitar con el comando no passive-interface
Router(config-router)#passive-interface gi0/0                     /Indicamos que no se envien paquetes OSPF sobre esta Interfaz
Router(config-router)#end                                         /Salimos de la configuracion

Router#show ip ospf neighbor                                      /verificar el estado de adyacencia de vecinos
Router#show ip protocols                                          /muestra los protocolos y conexiones a redes
Router#show ip ospf interface                                     /muestras las configuracion OSPF de las interfaces

Ajuste del Ancho de Banda de Referencia Predeterminado para Calculo del Costo:

Router>enable
Router#conf term
Router(config)#router ospf
Router(config-router)#auto-cost reference-bandwidth 1000         //ejemplo para una tecnologia Gigabit
RouteR(config-router)#auto-cost reference-bandwidth 10000        //ejemplo para una tecnologia 10gigabit

Luego podemos ver el costo actualizado de cada interfaz, por ejemplo:
Router#show ip ospf interface ser0/0/0

Ajuste del Ancho de Bande de la Interfaz

Router(config-if)#bandwidth 64                                   //ejemplo en el que asignamos 64Kb/s a una interfaz Serial
Router(config-if)#bandwidth 1024                                 //ejemplo en el que asignamos 1024Kb/s a una interfaz Serial
Router(config-if)#no bandwidth                                   //ejemplo para restaurar los valores predeterminados
Router(config-if)#ip ospf cost 15625                             //Configuro directamente el costo ospf de la interfaz aun cuando
                                                                 //el ancho de banda es el predeterminado
                                                                 

OSPFv3

***************Router1

Router(config)#ipv6 unicast-routing
Router(config)#interface gi0/0
Router(config-if)#description R1 LAN
Router(config-if)#ipv6 address 2001:db8:cafe:1::1/64
Router(config-if)#no shutdown
Router(config-if)#interface ser0/0/0
Router(config-if)#description Link To R2
Router(config-if)#ipv6 address 2001:db8:cafe:a001::1/64
Router(config-if)#clock rate 128000                             //Only for DCE Interfaz
Router(config-if)#no shutdown
Router(config-if)#interface ser0/0/1
Router(config-if)#description Link To R3
Router(config-if)#ipv6 address 2001:db8:cafe:a003::1/64
Router(config-if)#no shutdown
Router(config-if)#end

***************Router3

Router(config)#ipv6 unicast-routing
Router(config)#interface gi0/0
Router(config-if)#description R3 LAN
Router(config-if)#ipv6 address 2001:db8:cafe:3::1/64
Router(config-if)#no shutdown
Router(config-if)#interface ser0/0/0
Router(config-if)#description Link To R1
Router(config-if)#ipv6 address 2001:db8:cafe:a003::2/64
Router(config-if)#no shutdown
Router(config-if)#interface ser0/0/1
Router(config-if)#description Link To R2
Router(config-if)#clock rate 128000
Router(config-if)#ipv6 address 2001:db8:cafe:a002::2/64
Router(config-if)#no shutdown
Router(config-if)#end

****************Router2

Router(config)#ipv6 unicast-routing
Router(config)#interface gi0/0
Router(config-if)#description R2 LAN
Router(config-if)#ipv6 address 2001:db8:cafe:2::1/64
Router(config-if)#no shutdown
Router(config-if)#interface ser0/0/1
Router(config-if)#description Link To R2
Router(config-if)#ipv6 address 2001:db8:cafe:a002::1/64
Router(config-if)#no shutdown
Router(config-if)#interface ser0/0/0
Router(config-if)#description Link To R1
Router(config-if)#ipv6 address 2001:db8:cafe:a001::2/64
Router(config-if)#no shutdown
Router(config-if)#end


Despues de Configurar todas las interfaces con sus direcciones IPv6 pasamos a configuramos el ruteo OSPF:

Entramos en el modo de configuracion de Router:
Router(config)#ipv6 router ospf id-proceso
Configuramos los parametros globales de OSPFv3 como la ID de Router y el Ancho de banda de referencia
Router(config-router)#router-id 1.1.1.1
Router(config-router)#auto-cost reference-bandwidth 1000

























